-- Абоненты
CREATE TABLE IF NOT EXISTS resident (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    passport VARCHAR(12) UNIQUE NOT NULL,
    phone VARCHAR(15) UNIQUE NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL
);
COMMENT ON COLUMN resident.first_name IS 'Имя';
COMMENT ON COLUMN resident.last_name  IS 'Фамилия';
COMMENT ON COLUMN resident.passport_num IS 'Серия и номер паспорта';
COMMENT ON COLUMN resident.phone IS 'Контактный телефон';
COMMENT ON COLUMN resident.email IS 'Контактная почта';

-- Адрес дома
CREATE TABLE IF NOT EXISTS address (
    id SERIAL PRIMARY KEY,
    region VARCHAR(50) NOT NULL,
    city VARCHAR(50) NOT NULL,
    street VARCHAR(50) NOT NULL,
    house VARCHAR(6) NOT NULL
);
COMMENT ON COLUMN address.region IS 'Область';
COMMENT ON COLUMN address.city IS 'Город';
COMMENT ON COLUMN address.street IS 'Улица';
COMMENT ON COLUMN address.house IS 'Номер дома';

-- Маршрутизаторы
CREATE TABLE IF NOT EXISTS router (
    id SERIAL PRIMARY KEY,
    address_id INT REFERENCES address(id),
    model VARCHAR(50) NOT NULL,
    ports INT NOT NULL CHECK(ports > 0),
    port_speed INT NOT NULL CHECK( port_speed IN ( 10 , 100 , 1000 ) ),
    is_active BOOLEAN
);
COMMENT ON COLUMN router.model IS 'Производитель и модель';
COMMENT ON COLUMN router.ports IS 'Кол-во портов';
COMMENT ON COLUMN router.port_speed IS 'Максимальная скорость';
COMMENT ON COLUMN router.is_active IS 'в работе или отключен/сломан';

-- тарифный план
CREATE TABLE IF NOT EXISTS tariff (
    id SERIAL PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    speed INT NOT NULL CHECK( speed > 0 ),
    iptv BOOLEAN,
    archive BOOLEAN
);
COMMENT ON COLUMN tariff.name IS 'Наименование';
COMMENT ON COLUMN tariff.speed IS 'Скорость интернета';
COMMENT ON COLUMN tariff.iptv IS 'IP TV входит';
COMMENT ON COLUMN tariff.archive IS 'Архивный';

-- Договор
CREATE TABLE IF NOT EXISTS agreement (
    id SERIAL PRIMARY KEY,
    resident_id INT REFERENCES resident(id),
    tariff_id INT REFERENCES tariff(id),
    address_id INT REFERENCES address(id),
    apartment INT NOT NULL CHECK( apartment > 0 ),
    router_id INT REFERENCES router(id),
    port INT NOT NULL CHECK( port > 0 ),
    balance INT NOT NULL
);
COMMENT ON COLUMN agreement.apartment IS 'Номер квартиры';
COMMENT ON COLUMN agreement.port IS 'Порт в маршрутизаторе';
COMMENT ON COLUMN agreement.balance IS 'Баланс счёта';


-- Доступность тарифа в регионе с ценой в этом регионе
CREATE TABLE IF NOT EXISTS region_tariff (
    region VARCHAR(50) NOT NULL,
    tariff_id INT REFERENCES tariff(id),
    cost INT NOT NULL CHECK( cost > 0 ),
    CONSTRAINT region_tariff_id UNIQUE ( region , tariff_id )
);
COMMENT ON COLUMN region_tariff.region IS 'Область';
COMMENT ON COLUMN region_tariff.cost IS 'Абонентская плата для этой области';

-- Тестовые данные
INSERT INTO
  tariff( name , speed , iptv , archive )
VALUES
  ( 'Особый'      , 10   , FALSE , TRUE  ),
  ( 'Базовый'     , 100  , FALSE , FALSE ),
  ( 'Стандартный' , 100  , TRUE  , FALSE ),
  ( 'Супер 2021'  , 100  , FALSE , TRUE  ),
  ( 'Супер 2025'  , 1000 , FALSE , FALSE ),
  ( 'Супер+'      , 1000 , TRUE  , FALSE );

INSERT INTO
    region_tariff( region , tariff_id , cost )
VALUES
    ( 'Тульская область'     , 1 , 110 ),
    ( 'Рязанская область'    , 1 , 100 ),
    ( 'Белгородская область' , 1 , 100 ),
    ( 'Воронежская область'  , 1 , 120 ),
    ( 'Московская область'   , 2 , 150 ),
    ( 'Тульская область'     , 2 , 150 ),
    ( 'Рязанская область'    , 2 , 160 ),
    ( 'Белгородская область' , 2 , 160 ),
    ( 'Липецкая область'     , 2 , 150 ),
    ( 'Воронежская область'  , 2 , 160 ),
    ( 'Московская область'   , 3 , 250 ),
    ( 'Тульская область'     , 3 , 250 ),
    ( 'Рязанская область'    , 3 , 270 ),
    ( 'Белгородская область' , 3 , 260 ),
    ( 'Липецкая область'     , 3 , 260 ),
    ( 'Воронежская область'  , 3 , 240 ),
    ( 'Московская область'   , 4 , 120 ),
    ( 'Тульская область'     , 4 , 120 ),
    ( 'Белгородская область' , 4 , 130 ),
    ( 'Липецкая область'     , 4 , 130 ),
    ( 'Воронежская область'  , 4 , 125 ),
    ( 'Московская область'   , 5 , 180 ),
    ( 'Тульская область'     , 5 , 180 ),
    ( 'Белгородская область' , 5 , 200 ),
    ( 'Воронежская область'  , 5 , 199 ),
    ( 'Московская область'   , 6 , 299 ),
    ( 'Тульская область'     , 6 , 299 ),
    ( 'Белгородская область' , 6 , 299 ),
    ( 'Владимирская область' , 2 , 119 ),
    ( 'Владимирская область' , 3 , 149 ),
    ( 'Владимирская область' , 5 , 199 ),
    ( 'Владимирская область' , 6 , 299 ),
    ( 'Татарстан'            , 2 ,  99 ),
    ( 'Татарстан'            , 3 , 149 ),
    ( 'Татарстан'            , 5 , 299 ),
    ( 'Татарстан'            , 6 , 299 );

INSERT INTO
    address( region , city , street , house )
VALUES
    ( 'Белгородская область' , 'Белгород' , 'улица Гагарина'      , '23'   ),
    ( 'Белгородская область' , 'Белгород' , 'улица Гагарина'      , '88'   ),
    ( 'Белгородская область' , 'Белгород' , 'улица Лесная'        , '29'   ),
    ( 'Белгородская область' , 'Белгород' , 'улица Лужковская'    , '1'	   ),
    ( 'Белгородская область' , 'Белгород' , 'улица Спортивная'    , '6'	   ),
    ( 'Белгородская область' , 'Белгород' , 'улица Тихая'         , '9/1'  ),
    ( 'Белгородская область' , 'Белгород' , 'улица Тихая'         , '9/2'  ),
    ( 'Белгородская область' , 'Белгород' , 'улица Фрунзе'        , '14'   ),
    ( 'Владимирская область' , 'Владимир' , 'улица Грибоедова'    , '8'	   ),
    ( 'Владимирская область' , 'Владимир' , 'улица Красная'       , '19'   ),
    ( 'Владимирская область' , 'Владимир' , 'улица Кузнецкая'     , '15а'  ),
    ( 'Владимирская область' , 'Владимир' , 'улица Кузнецкая'     , '15в'  ),
    ( 'Владимирская область' , 'Владимир' , 'улица Ленинградская' , '10'   ),
    ( 'Владимирская область' , 'Владимир' , 'улица Лесная'        , '2'	   ),
    ( 'Владимирская область' , 'Владимир' , 'улица Солнечная'     , '4'	   ),
    ( 'Воронежская область'  , 'Воронеж'  , 'улица Заречная'      , '16'   ),
    ( 'Воронежская область'  , 'Воронеж'  , 'проспект Мира'       , '8'	   ),
    ( 'Воронежская область'  , 'Воронеж'  , 'улица Молодежная'    , '11'   ),
    ( 'Воронежская область'  , 'Воронеж'  , 'улица Новая'         , '3'	   ),
    ( 'Воронежская область'  , 'Воронеж'  , 'улица Советская'     , '27'   ),
    ( 'Воронежская область'  , 'Воронеж'  , 'улица Степная'       , '26'   ),
    ( 'Липецкая область'     , 'Липецк'   , 'улица Жемчужная'     , '5'	   ),
    ( 'Липецкая область'     , 'Липецк'   , 'улица Костякова'     , '24/1' ),
    ( 'Липецкая область'     , 'Липецк'   , 'улица Костякова'     , '24/4' ),
    ( 'Липецкая область'     , 'Липецк'   , 'улица Лесная'        , '35'   ),
    ( 'Липецкая область'     , 'Липецк'   , 'улица Октябрьская'   , '20'   ),
    ( 'Липецкая область'     , 'Липецк'   , 'улица Пушкина'       , '45'   ),
    ( 'Липецкая область'     , 'Липецк'   , 'улица Садовая'       , '11'   ),
    ( 'Липецкая область'     , 'Липецк'   , 'улица Центральная'   , '3'	   ),
    ( 'Московская область'   , 'Москва'   , 'улица Кленовая'      , '17'   ),
    ( 'Московская область'   , 'Москва'   , 'улица Ленина'        , '12'   ),
    ( 'Московская область'   , 'Москва'   , 'улица Октябрьская'   , '22'   ),
    ( 'Московская область'   , 'Москва'   , 'улица Пушкинская'    , '33'   ),
    ( 'Московская область'   , 'Москва'   , 'улица Радужная'      , '6'	   ),
    ( 'Московская область'   , 'Москва'   , 'улица Садовая'       , '31'   ),
    ( 'Московская область'   , 'Москва'   , 'улица Смешанная'     , '18'   ),
    ( 'Рязанская область'    , 'Рязань'   , 'площадь Победы'      , '2'    ),
    ( 'Рязанская область'    , 'Рязань'   , 'улица Дружбы'        , '7'	   ),
    ( 'Рязанская область'    , 'Рязань'   , 'улица Летняя'        , '5'	   ),
    ( 'Рязанская область'    , 'Рязань'   , 'улица Набережная'    , '18'   ),
    ( 'Рязанская область'    , 'Рязань'   , 'улица Речная'        , '19'   ),
    ( 'Рязанская область'    , 'Рязань'   , 'улица Солнечная'     , '12'   ),
    ( 'Татарстан'            , 'Казань'   , 'улица Березовая'     , '4'	   ),
    ( 'Татарстан'            , 'Казань'   , 'проспект Победы'     , '25'   ),
    ( 'Татарстан'            , 'Казань'   , 'Яблочный переулок'   , '4'	   ),
    ( 'Татарстан'            , 'Казань'   , 'улица Победы'        , '34'   ),
    ( 'Татарстан'            , 'Казань'   , 'улица Полевая'       , '30'   ),
    ( 'Татарстан'            , 'Казань'   , 'улица Седова'        , '22'   ),
    ( 'Тульская область'     , 'Тула'     , 'улица Кленовая'      , '7'	   ),
    ( 'Тульская область'     , 'Тула'     , 'улица Пролетарская'  , '10'   ),
    ( 'Тульская область'     , 'Тула'     , 'улица Рябиновая'     , '10'   ),
    ( 'Тульская область'     , 'Тула'     , 'улица Синичкина'     , '13'   ),
    ( 'Тульская область'     , 'Тула'     , 'улица Солнечная'     , '15'   ),
    ( 'Тульская область'     , 'Тула'     , 'улица Цветочная'     , '9'    );

INSERT INTO
  resident( first_name , last_name , passport , phone , email )
VALUES
    ( 'Иван'       , 'Иванов'       , '1234 567890' , '89001234567' , 'ivan.ivanov@yandex.ru'           ), -- 1
    ( 'Анна'       , 'Петрова'      , '2345 678901' , '89002345678' , 'anna.petrovа@yandex.ru'          ), -- 2
    ( 'Сергей'     , 'Смирнов'      , '3456 789012' , '89003456789' , 'sergey.smirnov@gmail.com'        ), -- 3
    ( 'Ольга'      , 'Кузнецова'    , '4567 890123' , '89004567890' , 'olga.kuznetsova@yandex.ru'       ), -- 4
    ( 'Дмитрий'    , 'Сидоров'      , '5678 901234' , '89005678901' , 'dmitry.sidorov@mail.ru'          ), -- 5
    ( 'Мария'      , 'Васильева'    , '6789 012345' , '89006789012' , 'maria.vasilieva@yandex.ru'       ), -- 6
    ( 'Алексей'    , 'Михайлов'     , '7890 123456' , '89007890123' , 'alexey.mikhailov@mail.ru'        ), -- 7
    ( 'Екатерина'  , 'Федорова'     , '8901 234567' , '89008901234' , 'ekaterina.fedorova@yandex.ru'    ), -- 8
    ( 'Николай'    , 'Соловьев'     , '9012 345678' , '89009012345' , 'nikolai.solovyev@gmail.com'      ), -- 9
    ( 'Татьяна'    , 'Григорьева'   , '0123 456789' , '89010123456' , 'tatiana.grigorieva@gmail.com'    ), -- 10
    ( 'Андрей'     , 'Смирнов'      , '1234 567891' , '89011234567' , 'andrey.smirnov@yandex.ru'        ), -- 11
    ( 'Светлана'   , 'Коваленко'    , '2345 678902' , '89012345678' , 'svetlana.kovalenko@mail.ru'      ), -- 12
    ( 'Виктория'   , 'Никифорова'   , '3456 789013' , '89013456789' , 'viktoriya.nikiforova@mail.ru'    ), -- 13
    ( 'Константин' , 'Яковлев'      , '4567 890124' , '89014567890' , 'konstantin.yakovlev@yandex.ru'   ), -- 14
    ( 'Елена'      , 'Иванова'      , '5678 901235' , '89015678901' , 'elena.ivanova@yandex.ru'         ), -- 15
    ( 'Павел'      , 'Кузьмин'      , '6789 012356' , '89016789012' , 'pavel.kuzmin@gmail.com'          ), -- 16
    ( 'Наталья'    , 'Ермакова'     , '7890 123467' , '89017890123' , 'natalya.ermakova@yandex.ru'      ), -- 17
    ( 'Артем'      , 'Сафонов'      , '8901 234578' , '89018901234' , 'artem.safonov@yandex.ru'         ), -- 18
    ( 'Марина'     , 'Федорова'     , '9012 345689' , '89019012345' , 'marina.fedorova@mail.ru'         ), -- 19
    ( 'Денис'      , 'Кудрявцев'    , '0123 456790' , '89020123456' , 'denis.kudryavtsev@yandex.ru'     ), -- 20
    ( 'Юлия'       , 'Волкова'      , '1234 567892' , '89021234567' , 'yulia.volkova@gmail.com'         ), -- 21
    ( 'Максим'     , 'Беляев'       , '2345 678903' , '89022345678' , 'maxim.belyaev@yandex.ru'         ), -- 22
    ( 'Анна'       , 'Громова'      , '4567 890125' , '89023456789' , 'anna.gromova@gmail.com'          ), -- 23
    ( 'Михаил'     , 'Соколов'      , '5678 901236' , '89024567890' , 'mikhail.sokolov@gmail.com'       ), -- 24
    ( 'Дарья'      , 'Кочеткова'    , '6789 012367' , '89025678901' , 'darya.kochetkova@yandex.ru'      ), -- 25
    ( 'Владислав'  , 'Мальцев'      , '7890 123478' , '89026789012' , 'vladislav.maltsev@yandex.ru'     ), -- 26
    ( 'Ксения'     , 'Суркова'      , '8901 234589' , '89027890123' , 'kseniya.surkova@mail.ru'         ), -- 27
    ( 'Илья'       , 'Новиков'      , '9012 345690' , '89028901234' , 'ilya.novikov@yandex.ru'          ), -- 28
    ( 'Светлана'   , 'Королева'     , '0123 456791' , '89029012345' , 'svetlana.koroleva@yandex.ru'     ), -- 29
    ( 'Григорий'   , 'Соловьев'     , '1234 567893' , '89030123456' , 'grigory.solovyev@yandex.ru'      ), -- 30
    ( 'Кристина'   , 'Фомина'       , '2345 678904' , '89031234567' , 'kristina.fomina@yandex.ru'       ), -- 31
    ( 'Алексей'    , 'Тихонов'      , '3456 789015' , '89032345678' , 'alexey.tikhonov@mail.ru'         ), -- 32
    ( 'Лидия'      , 'Устинова'     , '4567 890126' , '89033456789' , 'lidia.ustinova@yandex.ru'        ), -- 33
    ( 'Виктор'     , 'Кузнецов'     , '5678 901237' , '89034567890' , 'viktor.kuznetsov@yandex.ru'      ), -- 34
    ( 'Оксана'     , 'Ларионова'    , '6789 012368' , '89035678901' , 'oksana.larionova@gmail.com'      ), -- 35
    ( 'Артемий'    , 'Гусев'        , '7890 123479' , '89036789012' , 'artemiy.gusev@yandex.ru'         ), -- 36
    ( 'Полина'     , 'Назарова'     , '8901 234590' , '89037890123' , 'polina.nazarova@yandex.ru'       ), -- 37
    ( 'Станислав'  , 'Климов'       , '9012 345691' , '89038901234' , 'stanislav.klimov@yandex.ru'      ), -- 38
    ( 'Ирина'      , 'Баранова'     , '0123 456792' , '89039012345' , 'irina.baranova@mail.ru'          ), -- 39
    ( 'Владислав'  , 'Никитин'      , '1234 567894' , '89040123456' , 'vladislav.nikitin@yandex.ru'     ), -- 40
    ( 'Анастасия'  , 'Петрова'      , '2345 678905' , '89041234567' , 'anastasia.petrova@gmail.com'     ), -- 41
    ( 'Роман'      , 'Соловьев'     , '3456 789016' , '89042345678' , 'roman.solovyev@yandex.ru'        ), -- 42
    ( 'Екатерина'  , 'Михайлова'    , '4567 890127' , '89043456789' , 'ekaterina.mikhaylova@yandex.ru'  ), -- 43
    ( 'Дмитрий'    , 'Ковалев'      , '5678 901238' , '89044567890' , 'dmitry.kovalev@yandex.ru'        ), -- 44
    ( 'Мария'      , 'Федорова'     , '6789 012369' , '89045678901' , 'maria.fedorova@gmail.com'        ), -- 45
    ( 'Николай'    , 'Ершов'        , '7890 123480' , '89046789012' , 'nikolai.ershov@yandex.ru'        ), -- 46
    ( 'Татьяна'    , 'Громова'      , '8901 234591' , '89047890123' , 'tatyana.gromova@mail.ru'         ), -- 47
    ( 'Артем'      , 'Кузьмин'      , '9012 345692' , '89048901234' , 'artem.kuzmin@yandex.ru'          ), -- 48
    ( 'Ксения'     , 'Сидорова'     , '0123 456793' , '89049012345' , 'kseniya.sidorova@yandex.ru'      ), -- 49
    ( 'Антон'      , 'Степанов'     , '1234 567895' , '89050123456' , 'anton.stepanov@yandex.ru'        ), -- 50
    ( 'Светлана'   , 'Иванова'      , '2345 678906' , '89051234567' , 'svetlana.ivanova@yandex.ru'      ), -- 51
    ( 'Валентин'   , 'Григорьев'    , '3456 789017' , '89052345678' , 'valentin.grigoryev@yandex.ru'    ), -- 52
    ( 'Юлия'       , 'Лебедева'     , '4567 890128' , '89053456789' , 'yulia.lebedева@yandex.ru'        ), -- 53
    ( 'Игорь'      , 'Назаров'      , '5678 901239' , '89054567890' , 'igor.nazarov@yandex.ru'          ), -- 54
    ( 'Дарья'      , 'Кузнецова'    , '6789 012370' , '89055678901' , 'darya.kuznetsova@gmail.com'      ), -- 55
    ( 'Алексей'    , 'Соловьев'     , '7890 123481' , '89056789012' , 'alexey.solovyev@yandex.ru'       ), -- 56
    ( 'Полина'     , 'Громова'      , '8901 234592' , '89057890123' , 'polina.gromova@mail.ru'          ), -- 57
    ( 'Константин' , 'Фомин'        , '9012 345693' , '89058901234' , 'konstantin.fomin@yandex.ru'      ), -- 58
    ( 'Ирина'      , 'Синицына'     , '0123 456794' , '89059012345' , 'irina.sinitsina@yandex.ru'       ), -- 59
    ( 'Сергей'     , 'Панов'        , '1342 567890' , '89110123456' , 'Sergej_Panov@yandex.ru'          ), -- 60
    ( 'Артур'      , 'Жуков'        , '2453 678901' , '89020134567' , 'Artur_ZHukov@gmail.com'          ), -- 61
    ( 'Артём'      , 'Соболев'      , '3564 789012' , '89030145678' , 'Artyom_Sobolev@gmail.com'        ), -- 62
    ( 'Вера'       , 'Зайцева'      , '4675 890123' , '89040156789' , 'Vera_Zajceva@yandex.ru'          ), -- 63
    ( 'Марк'       , 'Соколов'      , '5786 901234' , '89052067890' , 'Mark_Sokolov@mail.ru'            ), -- 64
    ( 'Тимофей'    , 'Мартынов'     , '6897 012345' , '89063078901' , 'Timofej_Martynov@yandex.ru'      ), -- 65
    ( 'Виктория'   , 'Королева'     , '7908 123456' , '89074089012' , 'Viktoriya_Koroleva@gmail.com'    ), -- 66
    ( 'Иван'       , 'Зайцев'       , '8019 234567' , '89085090123' , 'Ivan_Zajcev@gmail.com'           ), -- 67
    ( 'Даниил'     , 'Медведев'     , '9120 345678' , '89096001234' , 'Daniil_Medvedev@yandex.ru'       ), -- 68
    ( 'Моника'     , 'Калугина'     , '0231 456789' , '89107012345' , 'Monika_Kalugina@yandex.ru'       ), -- 69
    ( 'Михаил'     , 'Рыбаков'      , '1342 567891' , '89118023456' , 'Mihail_Rybakov@mail.ru'          ), -- 70
    ( 'Василиса'   , 'Попова'       , '2453 678902' , '89129034567' , 'Vasilisa_Popova@gmail.com'       ), -- 71
    ( 'Алиса'      , 'Петрова'      , '3564 789013' , '89130045678' , 'Alisa_Petrova@mail.ru'           ), -- 72
    ( 'Матвей'     , 'Туманов'      , '4675 890124' , '89141056789' , 'Matvej_Tumanov@yandex.ru'        ), -- 73
    ( 'Дмитрий'    , 'Павлов'       , '5786 901235' , '89152067890' , 'Dmitrij_Pavlov@yandex.ru'        ), -- 74
    ( 'Мария'      , 'Панова'       , '6897 012356' , '89163078901' , 'Mariya_Panova@mail.ru'           ), -- 75
    ( 'Ирина'      , 'Молчанова'    , '7908 123467' , '89174089012' , 'Irina_Molchanova@gmail.com'      ), -- 76
    ( 'Лев'        , 'Агеев'        , '8019 234578' , '89185090123' , 'Lev_Ageev@gmail.com'             ), -- 77
    ( 'Илья'       , 'Попов'        , '9120 345689' , '89196001234' , 'Ilya_Popov@yandex.ru'            ), -- 78
    ( 'Лев'        , 'Романов'      , '0231 456790' , '89207012345' , 'Lev_Romanov@mail.ru'             ), -- 79
    ( 'Артём'      , 'Лукин'        , '1342 567892' , '89218023456' , 'Artyom_Lukin@gmail.com'          ), -- 80
    ( 'Мария'      , 'Кравцова'     , '2453 678903' , '89229034567' , 'Mariya_Kravcova@yandex.ru'       ), -- 81
    ( 'Софья'      , 'Розанова'     , '4675 890125' , '89230045678' , 'Sofya_Rozanova@mail.ru'          ), -- 82
    ( 'Екатерина'  , 'Кузьмина'     , '5786 901236' , '89241056789' , 'Ekaterina_Kuzmina@mail.ru'       ), -- 83
    ( 'Максим'     , 'Яковлев'      , '6897 012367' , '89252067890' , 'Maksim_YAkovlev@yandex.ru'       ), -- 84
    ( 'Маргарита'  , 'Алексеева'    , '7908 123478' , '89263078901' , 'Margarita_Alekseeva@gmail.com'   ), -- 85
    ( 'Тимофей'    , 'Нефедов'      , '8019 234589' , '89019402782' , 'Timofej_Nefedov@gmail.com'       ), -- 86
    ( 'Герман'     , 'Волков'       , '9120 345690' , '80129502893' , 'German_Volkov@yandex.ru'         ), -- 87
    ( 'Али'        , 'Лазарев'      , '0231 456791' , '81239602904' , 'Ali_Lazarev@gmail.com'           ), -- 88
    ( 'Матвей'     , 'Кондратьев'   , '1342 589367' , '82349703015' , 'Matvej_Kondratev@gmail.com'      ), -- 89
    ( 'Александр'  , 'Носов'        , '2345 690478' , '83459803126' , 'Aleksandr_Nosov@yandex.ru'       ), -- 90
    ( 'Марк'       , 'Фокин'        , '3456 701589' , '84569903237' , 'Mark_Fokin@yandex.ru'            ), -- 91
    ( 'Максим'     , 'Васильев'     , '4567 812690' , '85679003348' , 'Maksim_Vasilev@mail.ru'          ), -- 92
    ( 'Алия'       , 'Громова'      , '5678 923701' , '86789103459' , 'Aliya_Gromova@yandex.ru'         ), -- 93
    ( 'Лада'       , 'Пантелеева'   , '6789 036812' , '87899203560' , 'Lada_Panteleeva@gmail.com'       ), -- 94
    ( 'Амина'      , 'Соловьева'    , '7890 147923' , '88909303671' , 'Amina_Soloveva@yandex.ru'        ), -- 95
    ( 'Михаил'     , 'Гуляев'       , '8901 259034' , '89019403782' , 'Mihail_Gulyaev@yandex.ru'        ), -- 96
    ( 'Никита'     , 'Панфилов'     , '9012 369145' , '80129503893' , 'Nikita_Panfilov@mail.ru'         ), -- 97
    ( 'Милана'     , 'Аксенова'     , '0123 479256' , '81239603904' , 'Milana_Aksenova@mail.ru'         ), -- 98
    ( 'Василиса'   , 'Васильева'    , '1234 589467' , '82349704015' , 'Vasilisa_Vasileva@yandex.ru'     ), -- 99
    ( 'Ангелина'   , 'Кулешова'     , '2345 690578' , '83459804126' , 'Angelina_Kuleshova@yandex.ru'    ), -- 100
    ( 'Василиса'   , 'Фролова'      , '3456 701689' , '84569904237' , 'Vasilisa_Frolova@yandex.ru'      ), -- 101
    ( 'София'      , 'Лукина'       , '4567 812790' , '86789043459' , 'Sofiya_Lukina@gmail.com'         ), -- 102
    ( 'Мария'      , 'Назарова'     , '5678 923801' , '87899044560' , 'Mariya_Nazarova@gmail.com'       ), -- 103
    ( 'Артём'      , 'Королев'      , '6789 036912' , '88909045671' , 'Artyom_Korolev@yandex.ru'        ), -- 104
    ( 'Татьяна'    , 'Чернышева'    , '7890 148023' , '89019046782' , 'Tatyana_CHernysheva@mail.ru'     ), -- 105
    ( 'Платон'     , 'Поляков'      , '8901 259134' , '80129047893' , 'Platon_Polyakov@gmail.com'       ), -- 106
    ( 'Полина'     , 'Кудряшова'    , '9012 369245' , '81239048904' , 'Polina_Kudryashova@yandex.ru'    ), -- 107
    ( 'Тимофей'    , 'Петров'       , '0123 479356' , '82349049015' , 'Timofej_Petrov@yandex.ru'        ), -- 108
    ( 'Василий'    , 'Шестаков'     , '1234 589567' , '83459050126' , 'Vasilij_SHestakov@mail.ru'       ), -- 109
    ( 'Софья'      , 'Демидова'     , '2345 690678' , '84569051237' , 'Sofya_Demidova@yandex.ru'        ), -- 110
    ( 'Анна'       , 'Боброва'      , '3456 701789' , '85679052348' , 'Anna_Bobrova@yandex.ru'          ), -- 111
    ( 'Вячеслав'   , 'Новиков'      , '4567 812890' , '86789053459' , 'Vyacheslav_Novikov@mail.ru'      ), -- 112
    ( 'Арина'      , 'Аникина'      , '5678 923901' , '87899054560' , 'Arina_Anikina@gmail.com'         ), -- 113
    ( 'Амина'      , 'Щербакова'    , '6789 003712' , '88909055671' , 'Amina_SHCHerbakova@gmail.com'    ), -- 114
    ( 'Марьям'     , 'Маркина'      , '7890 114823' , '89670589012' , 'Maryam_Markina@yandex.ru'        ), -- 115
    ( 'Артём'      , 'Козлов'       , '8901 225934' , '89780590123' , 'Artyom_Kozlov@yandex.ru'         ), -- 116
    ( 'Руслан'     , 'Соболев'      , '9012 336945' , '89890501234' , 'Ruslan_Sobolev@gmail.com'        ), -- 117
    ( 'Виктория'   , 'Лаптева'      , '0123 447956' , '89900512345' , 'Viktoriya_Lapteva@gmail.com'     ), -- 118
    ( 'Алексей'    , 'Касьянов'     , '1234 508967' , '89120134567' , 'Aleksej_Kasyanov@yandex.ru'      ), -- 119
    ( 'Анатолий'   , 'Попов'        , '2345 619078' , '89230145678' , 'Anatolij_Popov@mail.ru'          ), -- 120
    ( 'Михаил'     , 'Козлов'       , '3456 720189' , '89340156789' , 'Mihail_Kozlov@mail.ru'           ), -- 121
    ( 'Олег'       , 'Куликов'      , '4567 831290' , '89450167890' , 'Oleg_Kulikov@yandex.ru'          ), -- 122
    ( 'Алисия'     , 'Николаева'    , '5678 942301' , '89560178901' , 'Alisiya_Nikolaeva@gmail.com'     ), -- 123
    ( 'Анна'       , 'Бирюкова'     , '6789 053412' , '89670189012' , 'Anna_Biryukova@yandex.ru'        ), -- 124
    ( 'Мария'      , 'Кириллова'    , '7890 164523' , '89780190123' , 'Mariya_Kirillova@gmail.com'      ), -- 125
    ( 'Варвара'    , 'Тихомирова'   , '8901 275634' , '89890101234' , 'Varvara_Tihomirova@yandex.ru'    ), -- 126
    ( 'Александра' , 'Громова'      , '9012 386745' , '89900112345' , 'Aleksandra_Gromova@gmail.com'    ), -- 127
    ( 'София'      , 'Родионова'    , '0123 497856' , '89010223456' , 'Sofiya_Rodionova@yandex.ru'      ), -- 128
    ( 'Татьяна'    , 'Волкова'      , '1234 518967' , '89120234567' , 'Tatyana_Volkova@z.ru'            ), -- 129
    ( 'Адам'       , 'Корнеев'      , '2345 629078' , '89230245678' , 'Adam_Korneev@yandex.ru'          ), -- 130
    ( 'Амина'      , 'Меркулова'    , '3456 730189' , '89340256789' , 'Amina_Merkulova@mail.ru'         ), -- 131
    ( 'Матвей'     , 'Смирнов'      , '4567 841290' , '89450267890' , 'Matvej_Smirnov@yandex.ru'        ), -- 132
    ( 'Илья'       , 'Власов'       , '5678 952301' , '89560278901' , 'Ilya_Vlasov@gmail.com'           ), -- 133
    ( 'Игорь'      , 'Тихонов'      , '6789 063512' , '89670289012' , 'Igor_Tihonov@yandex.ru'          ), -- 134
    ( 'Милана'     , 'Александрова' , '7890 174623' , '89780290123' , 'Milana_Aleksandrova@yandex.ru'   ), -- 135
    ( 'Роман'      , 'Кочетков'     , '8901 285734' , '89890201234' , 'Roman_Kochetkov@mail.ru'         ), -- 136
    ( 'Алина'      , 'Кондрашова'   , '9012 396845' , '89900212345' , 'Alina_Kondrashova@mail.ru'       ), -- 137
    ( 'Гордей'     , 'Сергеев'      , '0123 407956' , '89010323456' , 'Gordej_Sergeev@yandex.ru'        ), -- 138
    ( 'Ева'        , 'Агеева'       , '1234 528967' , '89120334567' , 'Eva_Ageeva@yandex.ru'            ), -- 139
    ( 'Егор'       , 'Соловьев'     , '2345 697803' , '89230345678' , 'Egor_Solovev@yandex.ru'          ), -- 140
    ( 'Дарья'      , 'Кузьмина'     , '4567 819025' , '89340356789' , 'Darya_Kuzmina@gmail.com'         ), -- 141
    ( 'Дарья'      , 'Романова'     , '5678 920136' , '89450367890' , 'Darya_Romanova@mail.ru'          ), -- 142
    ( 'Руслан'     , 'Уваров'       , '6789 031267' , '89560378901' , 'Ruslan_Uvarov@yandex.ru'         ), -- 143
    ( 'Андрей'     , 'Петров'       , '7890 142378' , '89670389012' , 'Andrej_Petrov@mail.ru'           ), -- 144
    ( 'Дарья'      , 'Давыдова'     , '8901 253489' , '89780390123' , 'Darya_Davydova@gmail.com'        ), -- 145
    ( 'Екатерина'  , 'Исаева'       , '9012 364590' , '89890301234' , 'Ekaterina_Isaeva@yandex.ru'      ), -- 146
    ( 'Адам'       , 'Никитин'      , '0123 475691' , '89900312345' , 'Adam_Nikitin@yandex.ru'          ), -- 147
    ( 'Ольга'      , 'Белова'       , '1234 586793' , '89010423456' , 'Olga_Belova@yandex.ru'           ), -- 148
    ( 'Савелий'    , 'Левин'        , '2345 697804' , '89010523456' , 'Savelij_Levin@gmail.com'         ), -- 149
    ( 'Виктория'   , 'Ушакова'      , '3456 708915' , '89120534567' , 'Viktoriya_Ushakova@gmail.com'    ), -- 150
    ( 'Марк'       , 'Яковлев'      , '4567 819026' , '89230545678' , 'Mark_YAkovlev@mail.ru'           ), -- 151
    ( 'Полина'     , 'Полякова'     , '5678 920137' , '89340556789' , 'Polina_Polyakova@yandex.ru'      ), -- 152
    ( 'Елизавета'  , 'Чернышева'    , '6789 031268' , '89450567890' , 'Elizaveta_CHernysheva@gmail.com' ), -- 153
    ( 'Алиса'      , 'Кузнецова'    , '7890 142379' , '89560578901' , 'Alisa_Kuznecova@mail.ru'         ), -- 154
    ( 'Лев'        , 'Орлов'        , '8901 253490' , '89570589012' , 'Lev_Orlov@yandex.ru'             ), -- 155
    ( 'Егор'       , 'Зайцев'       , '9012 364591' , '89957890123' , 'Egor_Zajcev@yandex.ru'           ), -- 156
    ( 'Виктория'   , 'Фролова'      , '0123 475692' , '89991474321' , 'Viktoriya_Frolova@mail.ru'       ), -- 157
    ( 'Виктория'   , 'Баранова'     , '1234 586794' , '89912242550' , 'Viktoriya_Baranova@gmail.com'    ), -- 158
    ( 'Александр'  , 'Морозов'      , '2345 697805' , '89981234254' , 'Aleksandr_morozov@yandex.ru'     ); -- 159

INSERT INTO
    router( address_id , model , ports , port_speed , is_active )
VALUES
    ( 1   , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 1
    ( 2   , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 2
    ( 2   , 'Alcatel AM4' , 16 ,   10 , TRUE ), -- 3
    ( 4   , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 4
    ( 5   , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 5
    ( 6   , 'Cisco M6'    , 16 ,  100 , TRUE ), -- 6
    ( 7   , 'Alcatel AM4' , 16 ,   10 , TRUE ), -- 7
    ( 8   , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 8
    ( 9   , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 9
    ( 10  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 10
    ( 11  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 11
    ( 12  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 12
    ( 13  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 13
    ( 14  , 'Cisco M6'    , 16 ,  100 , TRUE ), -- 14
    ( 15  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 15
    ( 16  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 16
    ( 17  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 17
    ( 18  , 'Alcatel AM4' , 16 ,   10 , TRUE ), -- 18
    ( 18  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 19
    ( 19  , 'Huawei EX-2' , 32 , 1000 , TRUE ), -- 20
    ( 20  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 21
    ( 21  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 22
    ( 22  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 23
    ( 23  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 24
    ( 24  , 'Huawei EX-2' , 32 , 1000 , TRUE ), -- 25
    ( 25  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 26
    ( 26  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 27
    ( 27  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 28
    ( 28  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 29
    ( 29  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 30
    ( 30  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 31
    ( 31  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 32
    ( 32  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 33
    ( 33  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 34
    ( 34  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 35
    ( 35  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 36
    ( 36  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 37
    ( 37  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 38
    ( 39  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 39
    ( 39  , 'Cisco M6'    , 16 ,  100 , TRUE ), -- 40
    ( 40  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 41
    ( 41  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 42
    ( 18  , 'Alcatel AM4' , 16 ,   10 , TRUE ), -- 43
    ( 42  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 44
    ( 43  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 45
    ( 44  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 46
    ( 45  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 47
    ( 46  , 'Cisco A2'    , 24 , 1000 , TRUE ), -- 48
    ( 47  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 49
    ( 48  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 50
    ( 49  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 51
    ( 50  , 'Cisco M6'    , 16 ,  100 , TRUE ), -- 52
    ( 51  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 53
    ( 52  , 'Huawei EX-1' , 16 , 1000 , TRUE ), -- 54
    ( 53  , 'Cisco A1'    , 16 , 1000 , TRUE ), -- 55
    ( 54  , 'Cisco A2'    , 24 , 1000 , TRUE ); -- 56

INSERT INTO
    agreement ( resident_id , tariff_id , address_id , apartment , router_id , port , balance )
VALUES
    ( 1   , 1 , 1   ,  4 , 1   ,  3 ,  -45 ), -- 1
    ( 2   , 5 , 1   ,  7 , 1   ,  4 ,  -38 ), -- 2
    ( 4   , 6 , 1   ,  8 , 1   ,  6 ,  -60 ), -- 3
    ( 5   , 4 , 1   , 14 , 1   ,  7 ,  -66 ), -- 4
    ( 6   , 2 , 1   , 25 , 1   ,  9 , -704 ), -- 5
    ( 7   , 1 , 2   ,  8 , 2   ,  6 , 1268 ), -- 6
    ( 8   , 2 , 2   , 35 , 2   ,  8 , -474 ), -- 7
    ( 9   , 6 , 2   , 34 , 2   , 10 , 1391 ), -- 8
    ( 10  , 6 , 2   , 19 , 3   ,  2 ,   65 ), -- 9
    ( 11  , 1 , 2   , 11 , 3   ,  3 , 1356 ), -- 10
    ( 13  , 6 , 4   ,  1 , 4   ,  4 , -773 ), -- 11
    ( 14  , 6 , 4   ,  2 , 4   ,  5 , 1451 ), -- 12
    ( 15  , 4 , 4   ,  6 , 4   ,  6 , 1707 ), -- 13
    ( 16  , 4 , 4   , 13 , 4   ,  7 , 1381 ), -- 14
    ( 17  , 2 , 4   , 19 , 4   ,  8 , -636 ), -- 15
    ( 18  , 2 , 4   , 87 , 4   , 12 ,  -58 ), -- 16
    ( 19  , 3 , 5   , 18 , 5   , 11 , 1335 ), -- 17
    ( 20  , 5 , 5   , 19 , 5   , 12 ,  574 ), -- 18
    ( 22  , 2 , 5   , 22 , 5   , 13 , -965 ), -- 19
    ( 23  , 6 , 6   , 12 , 6   ,  2 ,  437 ), -- 20
    ( 24  , 2 , 6   , 13 , 6   ,  3 ,  596 ), -- 21
    ( 25  , 2 , 6   , 35 , 6   ,  5 , -532 ), -- 22
    ( 26  , 1 , 7   , 11 , 7   ,  2 , -670 ), -- 23
    ( 29  , 1 , 7   , 23 , 7   ,  3 , 1797 ), -- 24
    ( 30  , 1 , 7   , 24 , 7   ,  4 , 1891 ), -- 25
    ( 31  , 3 , 8   ,  7 , 8   ,  2 , 1281 ), -- 26
    ( 32  , 6 , 8   ,  9 , 8   ,  4 ,  790 ), -- 27
    ( 33  , 4 , 9   , 43 , 9   ,  4 , 1627 ), -- 28
    ( 34  , 5 , 9   , 47 , 9   ,  6 , -872 ), -- 29
    ( 35  , 2 , 9   , 57 , 9   ,  9 , 1522 ), -- 30
    ( 36  , 3 , 9   , 94 , 9   , 12 , -312 ), -- 31
    ( 37  , 5 , 9   , 98 , 9   , 13 , 1139 ), -- 32
    ( 38  , 5 , 10  ,  5 , 10  ,  2 ,  806 ), -- 33
    ( 39  , 5 , 10  , 12 , 10  ,  4 ,   17 ), -- 34
    ( 40  , 2 , 10  , 14 , 10  ,  8 , 1258 ), -- 35
    ( 41  , 3 , 12  ,  1 , 12  ,  2 , 1516 ), -- 36
    ( 42  , 5 , 12  ,  2 , 12  ,  4 ,  -28 ), -- 37
    ( 43  , 6 , 12  ,  5 , 12  ,  5 ,  494 ), -- 38
    ( 44  , 5 , 13  , 11 , 13  ,  3 , -317 ), -- 39
    ( 45  , 6 , 13  , 16 , 13  ,  4 , 1614 ), -- 40
    ( 46  , 5 , 15  , 11 , 15  ,  3 , -997 ), -- 41
    ( 47  , 6 , 15  , 15 , 15  ,  4 , 1454 ), -- 42
    ( 48  , 2 , 15  , 16 , 15  ,  5 , 1032 ), -- 43
    ( 50  , 6 , 15  , 21 , 15  ,  7 ,  719 ), -- 44
    ( 51  , 5 , 15  , 23 , 15  ,  9 ,  992 ), -- 45
    ( 52  , 2 , 15  , 24 , 15  , 10 , -671 ), -- 46
    ( 53  , 6 , 15  , 35 , 15  , 13 , -700 ), -- 47
    ( 54  , 2 , 15  , 39 , 15  , 16 ,  541 ), -- 48
    ( 55  , 3 , 15  , 40 , 15  , 23 , -903 ), -- 49
    ( 56  , 5 , 16  , 47 , 16  ,  2 ,  855 ), -- 50
    ( 57  , 5 , 17  ,  6 , 17  ,  2 , -809 ), -- 51
    ( 58  , 2 , 17  ,  8 , 17  ,  4 ,  180 ), -- 52
    ( 59  , 4 , 17  ,  9 , 17  ,  9 , 1472 ), -- 53
    ( 60  , 1 , 18  , 13 , 18  , 13 ,  132 ), -- 54
    ( 61  , 1 , 18  , 35 , 18  , 14 ,  219 ), -- 55
    ( 62  , 1 , 18  , 38 , 18  , 15 ,  176 ), -- 56
    ( 63  , 1 , 19  , 22 , 20  , 19 , -851 ), -- 57
    ( 64  , 4 , 20  , 12 , 21  ,  8 , 1450 ), -- 58
    ( 65  , 2 , 20  , 13 , 21  ,  9 ,  397 ), -- 59
    ( 66  , 1 , 20  , 33 , 21  , 10 ,  266 ), -- 60
    ( 67  , 3 , 20  , 38 , 21  , 12 , 1254 ), -- 61
    ( 68  , 2 , 20  , 54 , 21  , 13 , 1734 ), -- 62
    ( 69  , 2 , 21  , 14 , 22  ,  7 , 1986 ), -- 63
    ( 70  , 3 , 21  , 16 , 22  ,  8 ,  140 ), -- 64
    ( 71  , 4 , 21  , 18 , 22  ,  9 , 1532 ), -- 65
    ( 72  , 2 , 21  , 21 , 22  , 11 ,  885 ), -- 66
    ( 73  , 2 , 21  , 27 , 22  , 13 , -112 ), -- 67
    ( 74  , 2 , 21  , 28 , 22  , 14 ,  125 ), -- 68
    ( 75  , 3 , 21  , 34 , 22  , 16 ,  917 ), -- 69
    ( 76  , 3 , 22  , 52 , 23  ,  6 ,  277 ), -- 70
    ( 77  , 3 , 22  , 58 , 23  , 21 , 1304 ), -- 71
    ( 78  , 2 , 22  , 67 , 23  , 22 ,  551 ), -- 72
    ( 79  , 4 , 23  , 13 , 24  , 11 ,  847 ), -- 73
    ( 80  , 3 , 24  ,  2 , 25  , 12 ,  764 ), -- 74
    ( 81  , 2 , 25  ,  2 , 26  , 13 , -459 ), -- 75
    ( 83  , 3 , 25  ,  6 , 26  , 14 ,  142 ), -- 76
    ( 84  , 4 , 25  ,  8 , 26  , 11 ,  -61 ), -- 77
    ( 85  , 4 , 25  , 35 , 26  , 10 ,  545 ), -- 78
    ( 86  , 4 , 25  , 36 , 26  , 12 , 1386 ), -- 79
    ( 87  , 2 , 25  , 46 , 26  ,  3 , 1507 ), -- 80
    ( 88  , 2 , 25  , 47 , 26  ,  2 ,  942 ), -- 81
    ( 89  , 4 , 25  , 49 , 26  ,  3 , 1064 ), -- 82
    ( 90  , 2 , 27  ,  8 , 28  ,  4 , -827 ), -- 83
    ( 91  , 3 , 27  ,  9 , 28  ,  5 ,  927 ), -- 84
    ( 92  , 3 , 27  , 13 , 28  ,  7 ,  267 ), -- 85
    ( 93  , 3 , 27  , 14 , 28  , 12 , -766 ), -- 86
    ( 94  , 3 , 27  , 15 , 28  , 11 , 1956 ), -- 87
    ( 95  , 2 , 27  , 19 , 28  , 10 , 1086 ), -- 88
    ( 96  , 2 , 27  , 22 , 28  ,  9 , 1267 ), -- 89
    ( 97  , 2 , 28  ,  8 , 29  ,  7 , -626 ), -- 90
    ( 98  , 3 , 29  ,  9 , 30  ,  3 , -316 ), -- 91
    ( 99  , 2 , 29  , 12 , 30  ,  8 , -233 ), -- 92
    ( 100 , 4 , 29  , 16 , 30  ,  7 , -321 ), -- 93
    ( 101 , 3 , 29  , 18 , 30  , 11 , 1388 ), -- 94
    ( 102 , 4 , 29  , 19 , 30  ,  6 , 1891 ), -- 95
    ( 103 , 4 , 29  , 27 , 30  , 13 ,  158 ), -- 96
    ( 104 , 6 , 29  , 33 , 30  ,  7 ,  929 ), -- 97
    ( 106 , 2 , 30  ,  3 , 31  ,  2 , -130 ), -- 98
    ( 107 , 6 , 33  ,  5 , 34  ,  3 , -803 ), -- 99
    ( 108 , 3 , 33  ,  9 , 34  ,  4 , 1017 ), -- 100
    ( 109 , 4 , 34  , 11 , 35  ,  4 ,  627 ), -- 101
    ( 110 , 6 , 35  , 12 , 36  ,  7 ,   25 ), -- 102
    ( 111 , 3 , 35  , 13 , 36  , 11 , -574 ), -- 103
    ( 113 , 5 , 35  , 27 , 36  , 12 , 1248 ), -- 104
    ( 114 , 5 , 35  , 29 , 36  , 13 ,  450 ), -- 105
    ( 115 , 2 , 36  ,  8 , 37  ,  6 , 1804 ), -- 106
    ( 116 , 2 , 36  , 11 , 37  ,  8 ,  207 ), -- 107
    ( 117 , 3 , 39  , 12 , 39  , 11 ,  257 ), -- 108
    ( 118 , 2 , 39  , 13 , 40  , 12 , 1273 ), -- 109
    ( 119 , 1 , 41  , 11 , 42  , 12 , -589 ), -- 110
    ( 121 , 3 , 41  , 14 , 42  , 13 , 1905 ), -- 111
    ( 122 , 1 , 41  , 15 , 42  , 14 , -585 ), -- 112
    ( 123 , 1 , 41  , 19 , 42  , 18 ,  915 ), -- 113
    ( 124 , 3 , 18  ,  3 , 43  ,  2 , 1455 ), -- 114
    ( 125 , 3 , 42  ,  8 , 44  ,  3 , -109 ), -- 115
    ( 126 , 6 , 42  ,  9 , 44  ,  4 , 1674 ), -- 116
    ( 127 , 3 , 42  , 17 , 44  ,  6 , 1167 ), -- 117
    ( 128 , 5 , 42  , 18 , 44  ,  8 ,  665 ), -- 118
    ( 129 , 2 , 44  ,  1 , 46  ,  2 , 1237 ), -- 119
    ( 130 , 5 , 44  ,  8 , 46  ,  4 , 1101 ), -- 120
    ( 131 , 2 , 44  ,  9 , 46  ,  6 ,  -93 ), -- 121
    ( 132 , 3 , 44  , 14 , 46  ,  8 , -897 ), -- 122
    ( 134 , 2 , 45  ,  4 , 47  ,  3 , -266 ), -- 123
    ( 135 , 3 , 45  ,  5 , 47  ,  4 ,  240 ), -- 124
    ( 136 , 3 , 45  , 18 , 47  ,  7 ,  393 ), -- 125
    ( 137 , 6 , 45  , 19 , 47  ,  8 , 1217 ), -- 126
    ( 138 , 2 , 45  , 27 , 47  , 11 , -583 ), -- 127
    ( 139 , 2 , 45  , 29 , 47  , 16 ,  730 ), -- 128
    ( 140 , 2 , 45  , 34 , 47  , 22 , 1686 ), -- 129
    ( 141 , 3 , 46  ,  2 , 48  , 11 ,  694 ), -- 130
    ( 142 , 6 , 47  ,  2 , 49  ,  6 , 1607 ), -- 131
    ( 143 , 6 , 48  ,  8 , 50  ,  4 ,  962 ), -- 132
    ( 144 , 3 , 49  ,  7 , 51  ,  4 , 1758 ), -- 133
    ( 145 , 6 , 51  ,  5 , 53  ,  4 ,  302 ), -- 134
    ( 146 , 4 , 52  ,  6 , 54  ,  9 ,   89 ), -- 135
    ( 148 , 6 , 52  ,  9 , 54  , 12 , -700 ), -- 136
    ( 149 , 5 , 53  ,  9 , 55  ,  2 ,  884 ), -- 137
    ( 150 , 4 , 53  , 10 , 55  ,  4 ,  209 ), -- 138
    ( 151 , 4 , 53  , 11 , 55  ,  6 ,  452 ), -- 139
    ( 152 , 1 , 53  , 19 , 55  ,  8 , -672 ), -- 140
    ( 153 , 5 , 54  , 19 , 56  ,  2 , -139 ), -- 141
    ( 154 , 2 , 54  , 22 , 56  ,  4 , 1400 ), -- 142
    ( 156 , 6 , 54  , 23 , 56  ,  6 ,  345 ), -- 143
    ( 157 , 3 , 54  , 32 , 56  , 18 , -802 ), -- 144
    ( 158 , 2 , 54  , 58 , 56  , 19 , 1267 ); -- 145
